RebelTechnology/OpenWare/Wizard/Wizard.ioc
USB_DEVICE.CLASS_NAME_HS=AUDIO
SH.FMC_D4_DA4.0=FMC_D4,sd-16b-d1
USB_DEVICE.VirtualMode-AUDIO_HS=Audio
ADC3.ClockPrescaler=ADC_CLOCK_SYNC_PCLK_DIV8
RCC.PLLSAIN=100
PF5.Signal=FMC_A5
USB_DEVICE.VirtualModeHS=Audio_HS
Dma.Request2=ADC3
SAI1.Synchro-SAI_B_SyncSlave=SAI_SYNCHRONOUS
Dma.Request1=SAI1_B
ADC3.Rank-32\#ChannelRegularConversion=2
Dma.SAI1_B.1.PeriphInc=DMA_PINC_DISABLE
PC4.Locked=true
PF0.Signal=FMC_A0
PC5.Signal=GPIO_Output
PE7.Signal=FMC_D4_DA4
SH.FMC_NBL0.ConfNb=1
USB_OTG_HS.dma_enable-Device_Only_FS=ENABLE
PD6.Signal=SAI1_SD_A
SAI1.Synchro-SAI_A_AsyncSlave=SAI_ASYNCHRONOUS
Dma.Request0=SAI1_A
Dma.SAI1_B.1.Priority=DMA_PRIORITY_VERY_HIGH
PE3.Mode=SAI_B_SyncSlave
PE2.GPIO_Label=CS_SCK
PC2.GPIO_Label=ADC2
Mcu.Pin84=VP_SYS_VS_Systick
USB_DEVICE.PRODUCT_STRING_AUDIO_HS=OWL-MIDI
Mcu.Pin85=VP_USB_DEVICE_VS_USB_DEVICE_AUDIO_HS
PB3.Locked=true
Mcu.Pin82=VP_FREERTOS_VS_CMSIS_V1
Mcu.Pin83=VP_RTC_VS_RTC_Activate
PA3.Signal=USART2_RX
Mcu.Pin86=VP_USB_HOST_VS_USB_HOST_AUDIO_FS
PA2.Locked=true
PB3.GPIO_Label=FLASH_SCK
SH.FMC_A3.ConfNb=1
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
ADC3.SamplingTime-31\#ChannelRegularConversion=ADC_SAMPLETIME_144CYCLES
SH.COMP_DAC1_group.0=DAC_OUT1,DAC_OUT1
RCC.I2SFreq_Value=96000000
USB_HOST.IPParameters=VirtualModeFS,USBH_HandleTypeDef-AUDIO_FS,USBH_MAX_NUM_ENDPOINTS-AUDIO_FS,USBH_MAX_SIZE_CONFIGURATION-AUDIO_FS,USBH_MAX_NUM_CONFIGURATION-AUDIO_FS,USBH_MAX_NUM_SUPPORTED_CLASS-AUDIO_FS
ADC3.DiscontinuousConvMode=DISABLE
Dma.ADC3.2.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
SH.ADCx_IN13.0=ADC3_IN13,IN13
SAI1.Synchro_A=SAI_ASYNCHRONOUS
SH.FMC_A9.ConfNb=1
SAI1.Synchro_B=SAI_SYNCHRONOUS
PB8.GPIOParameters=GPIO_Label
Dma.SAI1_B.1.Mode=DMA_CIRCULAR
PA7.Mode=Full_Duplex_Master
RCC.UART7Freq_Value=54000000
PB9.GPIO_Label=SW1
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate
PG1.Signal=FMC_A11
Dma.SAI1_A.0.Direction=DMA_MEMORY_TO_PERIPH
SH.FMC_SDCLK.ConfNb=1
PC8.Signal=GPIO_Input
PC4.Signal=GPIO_Output
ProjectManager.DefaultFWLocation=true
PD9.Signal=FMC_D14_DA14
USB_DEVICE.SERIALNUMBER_STRING_AUDIO_HS=00000000010D
ProjectManager.DeletePrevious=true
PB10.Locked=true
RCC.LCDTFToutputFreq_Value=25000000
Dma.SAI1_A.0.MemInc=DMA_MINC_ENABLE
USB_DEVICE.IPParameters=CLASS_NAME_HS,VirtualModeHS,SERIALNUMBER_STRING_AUDIO_HS,PRODUCT_STRING_AUDIO_HS,PID_AUDIO_HS,MANUFACTURER_STRING-AUDIO_HS,VID-AUDIO_HS,VirtualMode-AUDIO_HS
RCC.FamilyName=M
TIM2.Pulse-PWM\ Generation1\ CH1=512
PB9.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultEXTI
PC8.GPIO_Label=USB_HOST_PWR_FAULT
PA13.Signal=SYS_JTMS-SWDIO
PF7.Mode=IN5
VP_FREERTOS_VS_CMSIS_V1.Signal=FREERTOS_VS_CMSIS_V1
SH.ADCx_IN12.0=ADC3_IN12,IN12
SH.FMC_A15_BA1.ConfNb=1
PB2/BOOT1.Signal=GPIO_Input
ADC3.SamplingTime-34\#ChannelRegularConversion=ADC_SAMPLETIME_144CYCLES
ProjectManager.TargetToolchain=Makefile
PB10.GPIO_Label=CS_CS
Dma.SAI1_A.0.Mode=DMA_CIRCULAR
SH.FMC_D13_DA13.0=FMC_D13,sd-16b-d1
SH.FMC_D1_DA1.ConfNb=1
SH.S_TIM4_CH3.0=TIM4_CH3,PWM Generation3 CH3
PC5.GPIOParameters=GPIO_Label
RCC.VcooutputI2SQ=96000000
VP_USB_DEVICE_VS_USB_DEVICE_AUDIO_HS.Mode=AUDIO_HS
PF2.Signal=FMC_A2
PE2.GPIOParameters=GPIO_Label
PC2.Locked=true
RCC.USBFreq_Value=48000000
PF9.GPIO_Label=SW5
RCC.PLLSAIoutputFreq_Value=50000000
TIM4.Prescaler=100
PE11.Signal=FMC_D8_DA8
RCC.LSE_VALUE=32768
PA1.Signal=S_TIM5_CH2
PB1.Locked=true
SAI1.AudioMode-SAI_B_SyncSlave=SAI_MODESLAVE_RX
SAI1.FSDefinition-SAI_A_AsyncSlave=SAI_FS_CHANNEL_IDENTIFICATION
Dma.SAI1_A.0.Priority=DMA_PRIORITY_VERY_HIGH
SH.S_TIM4_CH3.ConfNb=1
RCC.VCOI2SOutputFreq_Value=192000000
PG9.GPIO_Label=TRIG_OUT
RCC.PLLSAIPCLKFreq_Value=50000000
board=Wizard
SAI1.IPParameters=Instance-SAI_A_AsyncSlave,VirtualMode-SAI_A_AsyncSlave,Instance-SAI_B_SyncSlave,VirtualMode-SAI_B_SyncSlave,Synchro-SAI_B_SyncSlave,FrameLength-SAI_B_SyncSlave,SlotSize-SAI_B_SyncSlave,AudioMode-SAI_B_SyncSlave,AudioMode-SAI_A_AsyncSlave,DataSize-SAI_A_AsyncSlave,FrameLength-SAI_A_AsyncSlave,SlotSize-SAI_A_AsyncSlave,SlotNumber-SAI_A_AsyncSlave,FSDefinition-SAI_A_AsyncSlave,FSDefinition-SAI_B_SyncSlave,Synchro-SAI_A_AsyncSlave,Synchro_A,Synchro_B
RCC.VCOOutputFreq_Value=336000000
PB15.Mode=Device_Only_FS
PH0/OSC_IN.Signal=RCC_OSC_IN
RCC.APB2Freq_Value=84000000
RCC.UART4Freq_Value=54000000
SH.ADCx_IN11.0=ADC3_IN11,IN11
MxCube.Version=5.6.0
SH.FMC_D13_DA13.ConfNb=1
USB_HOST.USBH_HandleTypeDef-AUDIO_FS=hUsbHostFS
PF10.Signal=ADC3_IN8
PE5.Mode=SAI_A_AsyncSlave
PC1.GPIO_Label=ADC3
VP_SYS_VS_Systick.Mode=SysTick
SH.FMC_D12_DA12.0=FMC_D12,sd-16b-d1
Dma.ADC3.2.MemInc=DMA_MINC_ENABLE
PF15.Signal=FMC_A9
SPI4.CalculateBaudRate=656.25 KBits/s
PA4.GPIOParameters=GPIO_Label
PF1.Signal=FMC_A1
PE6.Signal=SPI4_MOSI
SH.FMC_D11_DA11.ConfNb=1
RCC.UART5Freq_Value=54000000
ADC3.Channel-34\#ChannelRegularConversion=ADC_CHANNEL_8
RCC.IPParameters=48MHZClocksFreq_Value,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CECFreq_Value,CortexFreq_Value,EthernetFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,I2SClocksFreq_Value,I2SFreq_Value,LCDTFToutputFreq_Value,LPTIM1Freq_Value,LSE_VALUE,LSI_VALUE,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLI2SPCLKFreq_Value,PLLI2SQCLKFreq_Value,PLLI2SRCLKFreq_Value,PLLI2SRoutputFreq_Value,PLLM,PLLN,PLLQ,PLLQCLKFreq_Value,PLLQoutputFreq_Value,PLLSAIN,PLLSAIPCLKFreq_Value,PLLSAIQCLKFreq_Value,PLLSAIRCLKFreq_Value,PLLSAIoutputFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SAI1Freq_Value,SAI2Freq_Value,SAI_AClocksFreq_Value,SAI_BClocksFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,UART5Freq_Value,UART7Freq_Value,UART8Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USART6Freq_Value,USBFreq_Value,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value,VCOSAIOutputFreq_ValueQ,VcooutputI2S,VcooutputI2SQ
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F427Z(G-I)Tx
PE0.Signal=FMC_NBL0
PE12.Signal=FMC_D9_DA9
PA2.Signal=USART2_TX
PA13.GPIO_Label=SWDIO
Mcu.IP8=SAI1
Mcu.IP9=SPI1
PD14.Signal=FMC_D0_DA0
Mcu.IP6=RCC
Mcu.IP7=RTC
USB_HOST.USBH_MAX_SIZE_CONFIGURATION-AUDIO_FS=512
ProjectManager.CoupleFile=false
RCC.48MHZClocksFreq_Value=48000000
PB3.Signal=SPI1_SCK
RCC.SYSCLKFreq_VALUE=168000000
PA7.GPIO_Label=FLASH_MOSI
PA12.Mode=Host_Only
USB_HOST.USBH_MAX_NUM_ENDPOINTS-AUDIO_FS=10
KeepUserPlacement=true
TIM5.Prescaler=100
Dma.SAI1_B.1.Direction=DMA_PERIPH_TO_MEMORY
USB_HOST.USBH_MAX_NUM_CONFIGURATION-AUDIO_FS=4
PC5.GPIO_Label=FLASH_nCS
SAI1.Instance-SAI_B_SyncSlave=SAI$Index_Block_B
SH.GPXTI9.ConfNb=1
NVIC.EXTI9_5_IRQn=true\:10\:0\:true\:false\:true\:true\:true\:true
PA14.Signal=SYS_JTCK-SWCLK
ADC3.Rank-35\#ChannelRegularConversion=5
PC6.GPIOParameters=PinState,GPIO_Label
RCC.HSI_VALUE=16000000
PH0/OSC_IN.GPIO_Label=OSC1
RCC.PLLQ=7
RCC.PLLM=25
RCC.PLLN=336
PB2/BOOT1.Locked=true
PA2.Mode=Asynchronous
PB8.Signal=S_TIM4_CH3
PE3.GPIO_Label=CS_SDOUT
PC8.Locked=true
TIM5.Period=1023
SH.FMC_D8_DA8.ConfNb=1
RCC.APB1Freq_Value=42000000
ADC3.NbrOfConversionFlag=1
PB11.Locked=true
ProjectManager.DeviceId=STM32F427ZITx
Dma.ADC3.2.FIFOMode=DMA_FIFOMODE_DISABLE
ProjectManager.LibraryCopy=1
PA3.GPIO_Label=USART_MISO
ADC3.Rank-31\#ChannelRegularConversion=1
PB1.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultEXTI
PA7.Signal=SPI1_MOSI
